# St7SetNodeLabelStyle

Sets the display style for node labels.

long St7SetNodeLabelStyle(long uID, long LabelStyle)

Input Parameters

uID

Strand7 model file ID.

LabelStyle

One of lsNone, lsEntityNumber or lsIDNumber.

Dependencies
Font

Assigned using St7SetEntityFont.